"""
25.1 复制和视图

当运算和处理数组时，他们的数据有时候被拷贝到新的数组，有时候不是。这通常是新手的困惑之源。
这有三种情况：
1. 完全不拷贝
2. 视图(view)和浅复制
3. 深复制
"""
import numpy as np

# 简单的赋值，不拷贝数组对象或他们的数据
a = np.arange(12)
b = a
print(b is a) # True

b.shape = (3, 4)
print(a)
"""
[[ 0  1  2  3]
 [ 4  5  6  7]
 [ 8  9 10 11]]
"""
print(b)
"""
[[ 0  1  2  3]
 [ 4  5  6  7]
 [ 8  9 10 11]]
"""

def f(x):
    print(id(x))

f(a)
f(b)

# 不同数组对象分享同一个数据，视图方法创造一个新的数组对象指向同一数据
c = a.view()
print(c is a) # False
print(c.base is a) # True

# 切片数组返回它的一个视图
s = a[:, 1:3]
print(s)
"""
[[ 0 10 10  3]
 [ 4 10 10  7]
 [ 8 10 10 11]] 
"""
s[:] = 10
print(a, s)
"""
[[10 10]
 [10 10]
 [10 10]]
"""