# author : LJM - Jeson
# Email  : 878665865@qq.com
# coding : utf - 8
'''
爬取 B站视频，并下载
'''
class Spider():
    def __init__(self):
        self.url = ''


'''
分工：
    1. 代码
        。 爬 B 站视频、评论                       ---- 杨中华、位雪银                                      
            。一类中的某几个
                。视频和对应的评论放一个文件里
        。情感分析                                        ---- 娄继猛
            。调用 API
        。可视化                                          ---- 娄继猛
            。Pyecharts
    2. PPT                                               ---- 申艺婷
        。成员介绍
        。成员分工
        。项目简介
        。项目代码
        。项目流程
        。结果呈现
        
    3. 报告
        。目录
        。项目初心 -- why
        。成员介绍
        
        。成员分工
        。项目简介
        。项目代码
        
        。项目流程
        。结果呈现
        。附录
'''
